[
    { "id": 1, "texto": "¿Por qué los programadores confunden Halloween con Navidad? Porque OCT 31 == DEC 25." },
    { "id": 2, "texto": "¿Qué le dijo un bit al otro? Nos vemos en el bus de datos." },
    { "id": 3, "texto": "¿Cuál es el colmo de un programador? Tener problemas con el 'espacio personal'." },
    { "id": 4, "texto": "¿Qué hace un hacker en el gimnasio? ¡Ejecuta sentadillas!" },
    { "id": 5, "texto": "¿Cuántos programadores hacen falta para cambiar un bombillo? Ninguno, eso es un problema de hardware." },
    { "id": 6, "texto": "¿Por qué el código fue a terapia? Porque tenía demasiados problemas sin resolver." },
    { "id": 7, "texto": "¿Cómo se despiden dos desarrolladores? ¡Hasta el commit!" },
    { "id": 8, "texto": "¿Qué hace un programador cuando tiene frío? Cierra ventanas." },
    { "id": 9, "texto": "— ¡Mi computadora tiene hambre! — ¿Por qué? — Porque tiene muchos cookies." },
    { "id": 10, "texto": "¿Cómo se llama un gato programador? Scratch." },
    { "id": 11, "texto": "Error 404: chiste no encontrado." },
    { "id": 12, "texto": "¿Cuál es el café favorito de los programadores? El Java." },
    { "id": 13, "texto": "¿Por qué el servidor rompió con la base de datos? Porque perdió la conexión." },
    { "id": 14, "texto": "— ¿Qué clase de archivo es ese? — Uno `.zip`, porque está muy comprimido de tiempo." },
    { "id": 15, "texto": "¿Cómo se llama el padre de todos los bugs? NullPointerException." },
    { "id": 16, "texto": "¿Por qué el programador siempre está tranquilo? Porque maneja bien sus excepciones." },
    { "id": 17, "texto": "¿Cómo se llama un grupo de programadores musicales? Los Byte-les." },
    { "id": 18, "texto": "¿Qué hace un programador en el supermercado? Controla los flujos." },
    { "id": 19, "texto": "¿Cuál es el animal favorito de los desarrolladores? El pingüino de Linux." },
    { "id": 20, "texto": "¿Por qué nadie juega a las escondidas con JavaScript? Porque siempre encuentra el 'this'." },
    { "id": 21, "texto": "¿Qué le dijo el código a la documentación? Sin ti, nadie me entiende." },
    { "id": 22, "texto": "¿Por qué el desarrollador rompió con su pareja? Porque tenía demasiados conflictos de merge." },
    { "id": 23, "texto": "¿Cómo se suicida un programador? Con un stack overflow." },
    { "id": 24, "texto": "¿Qué hace un backend en una fiesta? Espera que alguien le mande una petición." },
    { "id": 25, "texto": "¿Cuál es el lenguaje de programación más romántico? Python, porque es 'sintácticamente sexy'." }
]
